Repository: haruyama/wapt-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: ''' 4.2 Information Gathering ''' ----
ja: ''' 4.2 情報収集 ''' ----

source: ''' 4.3 Testing for configuration management ''' ----
ja: ''' 4.3 構成管理のためのテスト ''' ----

source: '''Our approach in writing this guide'''
ja: '''このガイトを書く上ので我々のアプローチ'''

source: '''What is Web Application Penetration Testing?'''<br> A penetration test is a method of evaluating the security of a computer system or network by simulating an attack.
ja: '''Webアプリケーションペネトレーションテストとは?'''<br> ペネトレーションテストは, 攻撃をシミュレートしてコンピュータシステムないしネットワークのセキュリティを評価する方法です.

source: '''What is a vulnerability?'''<br>
ja: '''脆弱性とは?'''<br>

source: '''What is the OWASP testing methodology?'''<br>
ja: '''OWASP のテスト方法とは?'''<br>

source: * Collaborative: we usually perform brainstorming before the articles are written so we can share our ideas and develop a collective vision of the project.
ja: * 協調的: 通常我々は記事を書く前にブレインストーミングをして考えを共有しプロジェクトの共同のビジョンを発展させます.

source: <br> The following parameters represent two access points (gates) to the application: <pre> http://www.example.com/Appx.jsp?a=1&b=1 </pre> In this case, the application shows two gates (parameters a and b).
ja: <br> 以下のパラメータはアプリケーションに対する2つのアクセスポイント(ゲート)を表しています. <pre> http://www.example.com/Appx.jsp?a=1&b=1 </pre> この場合, アプリケーションは(パラメータa, b の) 2つのゲートを示しています.

source: A Web Application Penetration Test focuses only on evaluating the security of a web application.<br> The process involves an active analysis of the application for any weaknesses, technical flaws, or vulnerabilities.
ja: Webアプリケーションペネトレーションテストは、Webアプリケーションのセキュリティを評価にのみ焦点を当てています.<br>このプロセスは, 任意の弱点、技術的な欠陥、または脆弱性についてのアプリケーションのアクティブな分析を含んでいます.

source: A spreadsheet with the directory tree of the application and all the access points would be useful for the second phase.<br> <br> * Active mode: in this phase, the tester begins to test using the methodology described in the follow paragraphs.
ja: アプリケーションのディレクトリツリーとそのアクセスポイントすべてのスプレッドシートは, 次の段階のために有用でしょう.<br> <br> * アクティブモード: この段階では, テスターは以降の段落で説明する方法を用いてテストを始めます.

source: A test is an action that tends to show a vulnerability in the application.
ja: テストは, アプリケーションの脆弱性を示す傾向があるアクションです.

source: A threat is a potential attack that, by exploiting a vulnerability, may harm the assets owned by an application (resources of value, such as the data in a database or in the file system).
ja: 脅威は, アプリケーションが所有する資産(データベースやファイル·システム内のデータのような価値のある資源)に脆弱性を利用して損害を与える可能性がある潜在的な攻撃です.

source: A vulnerability is a flaw or weakness in a system's design, implementation, or operation and management that could be exploited to violate the system's security policy.
ja: 脆弱性は、システムのセキュリティポリシーを破る悪用される可能性があるシステムの設計や実装または運用や管理の不備や弱点です.

source: All the gates found in this phase represent a point of testing.
ja: この段階で見つかったゲートすべてが, テストのポイントを表します.

source: Any security issues that are found will be presented to the system owner together with an assessment of their impact and often with a proposal for mitigation or a technical solution.
ja: 見つかったセキュリティ問題は, それらの影響の評価と, 多くの場合緩和策や技術的な解決策の提案を加えて, システム所有者に提示されます.

source: At the end of this phase, the tester should understand all the access points (''gates'') of the application (e.g., HTTP headers, parameters, and cookies).
ja: この段階の最後には, テスターはアプリケーションのアクセスポイント("ゲート")(例えば, HTTPのヘッダ, パラメータ, クッキー)のすべてを理解する必要があります.

source: By using public tools (search engines), scanners, sending simple HTTP requests, or specially crafted requests, it is possible to force the application to leak information, e.g., disclosing error messages or revealing the versions and technologies used.<br>
ja: 公開のツール(サーチエンジン) や スキャナの利用や単純な HTTP リクエストや特別に工夫したリクエストの送信によって, アプリケーションに情報を漏らすよう強制するできます. 例えば, エラーメッセージを開示したり利用しているバージョンや技術の露出です.

source: Clearly, focusing only on the web application will not be an exhaustive test.
ja: 明らかに, Webアプリケーションにのみ集中するのは網羅的なテストではありません.

source: Discovery analysis can be useful to reveal details such as web applications used for administrative purposes.
ja: 検出解析は, 管理目的で利用されるウェブアプリケーションのような細部を暴露するのにも有用となります.

source: Everything is free.
ja: すべては自由です.

source: For example, the tester could find the following: <pre> https://www.example.com/login/Authentic_Form.html </pre> This may indicate an authentication form in which the application requests a username and a password.
ja: たとえば, テスターは以下のURLから推測できるでしょう. <pre> https://www.example.com/login/Authentic_Form.html </pre> このURLが示す先にはアプリケーションがユーザ名とパスワードを要求する認証フォームが含まれている事を示しているだろう.

source: In addition, it can reveal old versions of files or artifacts such as undeleted, obsolete scripts, crafted during the test/development phase or as the result of maintenance.
ja: 加えて, テスト/開発フェイズの間や保守の結果として作られた, 削除されていない/廃止されたスクリプトなどのファイルや成果物の古いバージョンを暴露することがあります.

source: In fact it takes only a single vulnerability to undermine the security of the entire infrastructure, and even small and (almost) unimportant problems may evolve into severe risks for another application on the same server.
ja: 実際, たった1つの脆弱性が全体のインフラのセキュリティを台無しにすることもありますし, 小さく(ほとんど)重要でない問題が同じサーバの別のアプリケーションの深刻なリクスに反転することさえあります.

source: In order to address these problems, it is of utmost importance to perform an in-depth review of configuration and known security issues.
ja: これらの問題に対処するためには, 構成と既知のセキュリティ問題についての詳細なレビューを行なうのが最も重要です.

source: Indeed, penetration testing is only an appropriate technique for testing the security of web applications under certain circumstances.
ja: 実際, ペネトレーションテストはある状況のもとでウェブアプリケーションをテストする妥当なテクニックにすぎません.

source: Information Gathering is the most critical step of an application security test.
ja: 情報収集はアプリケーションセキュリティテストのもっとも重要なステップです.

source: Information revealed will often be useful to a tester serving as input to more impacting follow-on tests.
ja: 明らかになった情報は, よりインパクトのある以降の攻撃の入力としてテスタにとって有用になる場合があります.

source: Information such as error codes can inform the tester about technologies and products being used by the application.<br> In many cases, error codes can be easily invoked without the need for specialist skills or tools, due to bad exception handling design and coding.
ja: このエラーコードのような情報は, アプリケーションで利用されている技術は製品の情報をテスターに与えます.<br> 多くの場合で, 設計やコーディングでの例外の扱いが悪いために, エラーコードは専門家のスキルやツールなしでも簡単に呼び出すことができます.

source: Information such as source code, HTTP methods permitted, administrative functionality, authentication methods, and infrastructural configurations can be obtained.<br>
ja: ソースコードや許可されている HTTP のメソッド, 管理機能, 認証法, インフラの設定といった情報が得られる場合があります.

source: It cannot be as comprehensive as the information possibly gathered by performing a broader infrastructure analysis.
ja: より広いインフラの分析を実行することで得られる情報のほうが包括的です.

source: Often analysis of the infrastructure and topology architecture can reveal a great deal about a web application.
ja: インフラとトポロジアーキテクチャの分析は, しばしばWebアプリケーションについて多くの情報をもたらします.

source: Penetration testing will never be an exact science where a complete list of all possible issues that should be tested can be defined.
ja: ペネトレーションテストは, テストされるべきすべての可能性のある問題の完全なリストを定義できる正確な科学になることはありません.

source: That means rough consensus, wider audience and participation.<br> This approach tends to create a defined Testing Methodology that will be: * Consistent * Reproducible * Under quality control<br> The problems that we want to be addressed are: * Document all * Test all We think it is important to use a method to test all known vulnerabilities and document all the pen test activities.<br>
ja: これは, 粗い同意とより広い観衆や参加を意味します.<br> このアプローチは, 以下のような性質を持つようにテストの方法論を定義する傾向があります. * 一貫している * 再現可能である * 品質管理されている<br> 我々が対処したい問題は以下の通りです: * 文書 すべてl * テスト すべて 我々は, すべての既知の脆弱性をテストする方法を利用することとすべてのペネトレーションテストについて文書化することが重要と考えています.

source: The first phase in security assessment is focused on collecting as much information as possible about a target application.
ja: セキュリティ評価の最初の段階では, ターゲットについての情報を可能な限り多く集めることに焦点を当てます.

source: The Information Gathering section explains how to perform a passive mode test.
ja: 情報収集の節でパッシブモードのテストをどのように実行するか説明します.

source: The OWASP approach is Open and Collaborative: * Open: every security expert can participate with his or her experience in the project.
ja: OWASP のアプローチはオープンで協調的(Collaborative)です: * オープン: セキュリティの専門家は全員プロジェクトに自らの経験を持って参加できます.

source: The goal is to collect all the possible testing techniques, explain them, and keep the guide updated.<br> The OWASP Web Application Penetration Testing method is based on the black box approach.
ja: すべての可能なテストテクニックを収集し, それらを説明し, ガイドを更新し続けることが目標です.<br> OWASP ウェブアプリケーションペネトレーションテスト法は, ブラックボックスアプローチに基きます.

source: The listener could reveal sensitive data as well as configuration settings or running database instances if insecurely configured and probed with manual or automated techniques.
ja: リスナは, 安全でなく設定された場合にマニュアルないし自動化された技術で検査されると, 機密データだけでなく構成の設定や実行しているデータベースインスタンスについて漏らしてしまいます.

source: The security test should endeavour to test as much of the code base as possible.
ja: セキュリティテストは, コードベースの可能な限り大きな部分に対してテストするよう努める必要があります.

source: The tester knows nothing or very little information about the application to be tested.
ja: テスターはテストされるアプリケーションについてなにも知らないかほんの少しの情報しか知りません.

source: The testing model consists of: * Tester: Who performs the testing activities * Tools and methodology: The core of this Testing Guide project * Application: The black box to test The test is divided into 2 phases: * Passive mode: in the passive mode, the tester tries to understand the application's logic, and plays with the application.
ja: テストのモデルは以下から構成されます: * テスター: テスト活動をする人 * ツールと方法: このテストガイドプロジェクトのコア * アプリケーション: テストされるブラックボックス テストは2つの段階に分割されます: * パッシブモード: パッシブモードでは, テスターはアプリケーションのロジックを理解しようと試み, アプリケーションをつつきます.

source: This Chapter describes the OWASP Web Application Penetration testing methodology and explains how to test each vulnerability.
ja: この章では、OWASPのWebアプリケーションペネトレーションテストの方法とそれぞれの脆弱性をテストする方法について説明します.

source: This section will help you identify and map out every area within the application that should be investigated once your enumeration and mapping phase has been completed.
ja: この節では, 列挙とマッピングフェイズが完了した後で調査すべきアプリケーション内のすべての領域を特定しマッピングする方法を示します.

source: This task can be carried out in many different ways.
ja: このタスクは, 異なる多くの方法で実行できます.

source: Thus mapping all possible paths through the code to facilitate thorough testing is paramount.
ja: ですので, 徹底したテストを支援するためにコードへのすべての可能なパスをマッピングすることは, 最重要です.

source: Tools can be used for information gathering, for example, an HTTP proxy to observe all the HTTP requests and responses.
ja: 情報を集めるのにツールが利用できます. 例えば, すべてのHTTPリクエストとレスポンスを観察するためにHTTP pxoxy を用います.

source: We have split the set of active tests in 9 sub-categories for a total of 66 controls: * Configuration Management Testing * Business Logic Testing * Authentication Testing * Session Management Testing * Authorization testing * Data Validation Testing * Denial of Service Testing * Web Services Testing * Ajax Testing
ja: アクティブテストの集合を, 66のコントロールすべてについて9つのサブカテゴリに分割しています. * Business Logic Testing * Authentication Testing * Session Management Testing * Authorization testing * Data Validation Testing * Denial of Service Testing * Web Services Testing * Ajax Testing

source: [[Testing for Application Discovery (OWASP-IG-005)|4.2.5 Application Discovery (OWASP-IG-005)]] [rename to "Enumerate applications on webserver"]<br> Application discovery is an activity oriented to the identification of the web applications hosted on a web server/application server.<br> This analysis is important because often there is not a direct link connecting the main application backend.
ja: [[Testing for Application Discovery (OWASP-IG-005)|4.2.5 アプリケーションの検出 (OWASP-IG-005)]] [rename to "Enumerate applications on webserver"]<br> アプリケーションの検出は, ウェブサーバ/アプリケーションサーバにホストされたウェブアプリケーションの特定のための行動です.<br> メインアプリケーションバックエンドと接続する直接のリンクがない場合がしばしばあるので, この解析は重要です.

source: [[Testing for DB Listener (OWASP-CM-002)|4.3.2 DB Listener Testing (OWASP-CM-002)]]<br> During the configuration of a database server, many DB administrators do not adequately consider the security of the DB listener component.
ja: [[Testing for DB Listener (OWASP-CM-002)|4.3.2 DB リスナのテスト (OWASP-CM-002)]]<br> データベースサーバの設定で, 多くの DB 管理者は DBリスナコンポーネントのセキュリティを適切に考慮していません.

source: [[Testing for Error Codes (OWASP-IG-006)|4.2.6 Analysis of Error Codes (OWASP-IG-006)]]<br> During a penetration test, web applications may divulge information that is not intended to be seen by an end user.
ja: [[Testing for Error Codes (OWASP-IG-006)|4.2.6 エラーコードの解析 (OWASP-IG-006)]]<br> 侵入テスト中に, ウェブアプリケーションは, エンドユーザに見られることを意図してない情報を漏らすことがあります.

source: [[Testing for SSL-TLS (OWASP-CM-001)|4.3.1 SSL/TLS Testing (OWASP-CM-001)]]<br> SSL and TLS are two protocols that provide, with the support of cryptography, secure channels for the protection, confidentiality, and authentication of the information being transmitted.<br> Considering the criticality of these security implementations, it is important to verify the usage of a strong cipher algorithm and its proper implementation.
ja: [[Testing for SSL-TLS (OWASP-CM-001)|4.3.1 SSL/TLS のテスト (OWASP-CM-001)]]<br> SSL と TLS は, 暗号のサポートにより転送する情報の保護, 機密性, 認証をする安全なチャンネルを提供するプロトコルです.<br> これらのセキュリティ実装の重要性を考慮すると, 強い暗号アルゴリズムとその適切な実装の利用がされているか確認するのは重要です.

source: [[Testing for Web Application Fingerprint (OWASP-IG-004)|4.2.4 Testing Web Application Fingerprint (OWASP-IG-004)]]<br> Application fingerprint is the first step of the Information Gathering process; knowing the version and type of a running web server allows testers to determine known vulnerabilities and the appropriate exploits to use during testing.
ja: [[Testing for Web Application Fingerprint (OWASP-IG-004)|4.2.4 ウェブサーバの指紋のテスト (OWASP-IG-004)]]<br> アプリケーションの指紋の収集は, 情報収集プロセスの最初のステップです. 動作しているウェブサーバのバージョンや種類を知ることで, テスト中に用いる既知の脆弱性や適切なエクスプロイトを決定できます.

source: [[Testing for Web Server Fingerprint (OWASP-IG-00x)|4.2.x Testing Web Server Fingerprint (OWASP-IG-00x)]]<br> Application fingerprint is the first step of the Information Gathering process; knowing the version and type of a running web server allows testers to determine known vulnerabilities and the appropriate exploits to use during testing.
ja: [[Testing for Web Server Fingerprint (OWASP-IG-00x)|4.2.x ウェブサーバの指紋のテスト (OWASP-IG-00x)]]<br> アプリケーションの指紋の収集は, 情報収集プロセスの最初のステップです. 動作しているウェブサーバのバージョンや種類を知ることで, テスト中に用いる既知の脆弱性や適切なエクスプロイトを決定できます.

source: [[Testing for application configuration management (OWASP-CM-004)|4.3.4 Application Configuration Management Testing (OWASP-CM-004)]]<br> Web applications hide some information that is usually not considered during the development or configuration of the application itself.<br> This data can be discovered in the source code, in the log files or in the default error codes of the web servers.
ja: [[Testing for application configuration management (OWASP-CM-004)|4.3.4 アプリケーションの構成管理のテスト (OWASP-CM-004)]]<br> Web アプリケーションは, アプリケーション自身の開発や設定の間に通常考慮されていないいくつかの情報を隠します.<br> このデータは, ソースコードやログファイル, Web サーバのデフォルトのエラーコードから発見できることがあります.

source: [[Testing for infrastructure configuration management (OWASP-CM-003)|4.3.3 Infrastructure Configuration Management Testing (OWASP-CM-003)]]<br> The intrinsic complexity of interconnected and heterogeneous web server infrastructure, which can count hundreds of web applications, makes configuration management and review a fundamental step in testing and deploying every single application.
ja: [[Testing for infrastructure configuration management (OWASP-CM-003)|4.3.3 インフラ構成管理のテスト (OWASP-CM-003)]]<br> 数百のWebアプリケーションからなることもある, 相互接続された様々な種類の Web サーバインフラ固有の複雑さは, 構成の管理を行なうことと, 1つ1つのアプリケーションについてテストとデプロイの基本的な手順をレビューすることを必要とします.

source: [[Testing: Identify application entry points (OWASP-IG-003)|4.2.3 Identify application entry points (OWASP-IG-003)]]<br> Enumerating the application and its attack surface is a key precursor before any attack should commence.
ja: [[Testing: Identify application entry points (OWASP-IG-003)|4.2.3 アプリケーションのエントリポイントの特定 (OWASP-IG-003)]]<br> 攻撃を行なう前に, アプリケーションとその攻撃箇所を列挙するのは重要な準備です.

source: [[Testing: Identify application exit/handover points (OWASP-IG-00x)|4.2.x Identify application exit/handover points (OWASP-IG-00x)]]<br> Identify the functional exit points of the application and points where the application hands over to another application that may, or may not, be within scope of testing (e.g. handover to a payment gateway).
ja: [[Testing: Identify application exit/handover points (OWASP-IG-00x)|4.2.x アプリケーションの終了/移譲ポイントの特定 (OWASP-IG-00x)]]<br> アプリケーションの機能の終了ポイントと(決済ゲートウェイへの移譲のような) テストのスコープに入れる可能性のある他のアプリケーションへ処理を移譲する点を特定します.

source: [[Testing: Map paths through the application (OWASP-IG-00x)|4.2.x Map paths through the application (OWASP-IG-00x)]]<br> Enumerating the application and its attack surface is a key precursor before any attack should commence.
ja: [[Testing: Map paths through the application (OWASP-IG-00x)|4.2.x アプリケーションのパスのマッピング (OWASP-IG-00x)]]<br> 攻撃を行なう前に, アプリケーションとその攻撃箇所を列挙するのは重要な準備です.

source: [[Testing: Review webpage comments and metadata (OWASP-IG-00x)|4.2.x Review webpage comments and metadata(OWASP-IG-00x)]] Review the webpage metadata, HTML, JavaScript comments for sensitive information and disabled links/scripts.
ja: [[Testing: Review webpage comments and metadata (OWASP-IG-00x)|4.2.x ウェブページのコメントとメタデータのレビュー(OWASP-IG-00x)]] 重要の情報や無効となったリンクやスクリプトがないか, ウェブページのメタデータや HTML/Javascript のコメントをレビューします.

source: [[Testing: Search engine discovery/reconnaissance (OWASP-IG-002)|4.2.2 Search Engine Discovery/Reconnaissance (OWASP-IG-002)]]<br> Search engines, such as Google, can be used to discover issues related to the web application structure or error pages produced by the application that have been publicly exposed.
ja: [[Testing: Search engine discovery/reconnaissance (OWASP-IG-002)|4.2.2 サーチエンジンによる発見や調査 (OWASP-IG-002)]]<br> Google のようはサーチエンジンは, Webアプリケーションの構造や公けに露出したアプリケーションによって生成されたエラーページに関する問題を発見するのに利用できる.

source: [[Testing: Spiders, Robots, and Crawlers (OWASP-IG-001)|4.2.1 Spiders, Robots and Crawlers (OWASP-IG-001)]] [rename to "Review webserver metafiles" ] This phase of the Information Gathering process consists of browsing and capturing resources related to the application being tested.
ja: [[Testing: Spiders, Robots, and Crawlers (OWASP-IG-001)|4.2.1 スパイダーやロボット, クローラー (OWASP-IG-001)]] [rename to "Review webserver metafiles" ] 情報収集プロセスのこのフェイズでは, テストするアプリケーションに関する資源をブラウズし保存することから構成されます.
